app/views/expense_categories/index.html.erb

        <td><%= link_to expense_category.category_name, expense_category_path(expense_category) %></td>
        <td><%= expense_category.expense_items.count %></td>
---
SELECT COUNT(*) FROM "expense_items" WHERE "expense_items"."expense_category_id" = 3