app/controllers/expense_sources_controller.rb

SELECT "expense_sources".* FROM "expense_sources" WHERE "expense_sources"."user_id" = 1
---
  def new
    @expense_source = ExpenseSource.new
    @expense_sources = ExpenseSource.where(:user_id => current_user.id)

INSERT INTO "expense_sources" ("created_at", "source", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 25 Dec 2013 04:28:01 UTC +00:00], ["source", "newsource"], ["updated_at", Wed, 25 Dec 2013 04:28:01 UTC +00:00], ["user_id", 1]]
---
  def create
    @expense_source = ExpenseSource.new(params[:expense_source])

    respond_to do |format|
      if @expense_source.save