app/controllers/expense_items_controller.rb

SELECT "expense_items".* FROM "expense_items"
---
  def index
    @expense_items = ExpenseItem.all

SELECT "expense_items".* FROM "expense_items" WHERE "expense_items"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @expense_item = ExpenseItem.find(params[:id])

SELECT "expense_sources".* FROM "expense_sources" WHERE "expense_sources"."user_id" = 1
SELECT "expense_categories".* FROM "expense_categories" WHERE "expense_categories"."user_id" = 1
---
  def new
    @expense_item = ExpenseItem.new
    @source_array = ExpenseSource.where(:user_id => current_user.id).map { |source| ["#{source.source}", source.id] }
    p "*"*80
    p @source_array
    @category_array = ExpenseCategory.where(:user_id => current_user.id).map { |category| ["#{category.category_name}", category.id] }

INSERT INTO "expense_items" ("amount", "comment", "created_at", "date", "expense_category_id", "expense_source_id", "item", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    p "&"*80
    p params
    @expense_item = ExpenseItem.new(params[:expense_item])

    respond_to do |format|
      if @expense_item.save