app/controllers/expense_categories_controller.rb

SELECT "expense_categories".* FROM "expense_categories" WHERE "expense_categories"."user_id" = 1
---
  def index
    @expense_categories = ExpenseCategory.where(:user_id => current_user.id)

SELECT "expense_categories".* FROM "expense_categories" WHERE "expense_categories"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @expense_category = ExpenseCategory.find(params[:id])

SELECT "expense_categories".* FROM "expense_categories" WHERE "expense_categories"."user_id" = 1
---
  def new
    @expense_category = ExpenseCategory.new
    @expense_categories = ExpenseCategory.where(:user_id => current_user.id)

INSERT INTO "expense_categories" ("category_name", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["category_name", "Food"], ["created_at", Wed, 25 Dec 2013 00:32:17 UTC +00:00], ["updated_at", Wed, 25 Dec 2013 00:32:17 UTC +00:00], ["user_id", nil]]
---
  def create
    @expense_category = ExpenseCategory.new(params[:expense_category])

    respond_to do |format|
      if @expense_category.save

SELECT "expense_categories".* FROM "expense_categories" WHERE "expense_categories"."id" = $1 LIMIT 1  [["id", "2"]]
DELETE FROM "expense_categories" WHERE "expense_categories"."id" = $1  [["id", 2]]
---
  def destroy
    @expense_category = ExpenseCategory.find(params[:id])
    @expense_category.destroy