app/controllers/income_items_controller.rb

SELECT "income_items".* FROM "income_items" WHERE "income_items"."user_id" = 1 ORDER BY date
---
  def index
    @income_items = IncomeItem.where(:user_id => current_user.id).order(params[:sort])

SELECT "income_items".* FROM "income_items" WHERE "income_items"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @income_item = IncomeItem.find(params[:id])

INSERT INTO "income_items" ("amount", "comment", "created_at", "date", "income_category_id", "income_method_id", "item", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @income_item = IncomeItem.new(params[:income_item])

    respond_to do |format|
      if @income_item.save