app/controllers/income_items_controller.rb

SELECT "income_items".* FROM "income_items"
---
  def index
    @income_items = IncomeItem.all