app/controllers/sessions_controller.rb

	def create
		@user = User.find_by_username(params[:user][:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'fkldjs' LIMIT 1