app/controllers/users_controller.rb

	def update
    respond_to do |format|
      if @user.update_attributes(params[:user])
---
UPDATE "users" SET "password_digest" = '$2a$10$UXgMCuKk.tIdnBnsTmZO0uodzRdlagZbekc6DlDMtjLjr6EZdc9Pi', "updated_at" = '2013-12-25 04:06:32.690992' WHERE "users"."id" = 1